---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetServerGUID
source: html/10a19cd7-d552-6382-262b-4bf268957821.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetServerGUID Method

Returns the GUID of the API server.

## Syntax (C#)
```csharp
public Guid GetServerGUID()
```

## Returns
The GUID of the API server

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This RebarFreeFormAccessor doesn't contain a valid rebar reference.